<html>
<head>
    <title>ART-INK </title>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
<!--===============================================================================================-->	
    <link rel="icon" type="image/png" href="images/icons/favicon.png"/>
<!--===============================================================================================-->
    <link rel="stylesheet" type="text/css" href="vendor/bootstrap/css/bootstrap.min.css">
<!--===============================================================================================-->
    <link rel="stylesheet" type="text/css" href="fonts/font-awesome-4.7.0/css/font-awesome.min.css">
<!--===============================================================================================-->
    <link rel="stylesheet" type="text/css" href="fonts/iconic/css/material-design-iconic-font.min.css">
<!--===============================================================================================-->
    <link rel="stylesheet" type="text/css" href="fonts/linearicons-v1.0.0/icon-font.min.css">
<!--===============================================================================================-->
    <link rel="stylesheet" type="text/css" href="vendor/animate/animate.css">
<!--===============================================================================================-->	
    <link rel="stylesheet" type="text/css" href="vendor/css-hamburgers/hamburgers.min.css">
<!--===============================================================================================-->
    <link rel="stylesheet" type="text/css" href="vendor/animsition/css/animsition.min.css">
<!--===============================================================================================-->
    <link rel="stylesheet" type="text/css" href="vendor/select2/select2.min.css">
<!--===============================================================================================-->	
    <link rel="stylesheet" type="text/css" href="vendor/daterangepicker/daterangepicker.css">
<!--===============================================================================================-->
    <link rel="stylesheet" type="text/css" href="vendor/slick/slick.css">
<!--===============================================================================================-->
    <link rel="stylesheet" type="text/css" href="vendor/MagnificPopup/magnific-popup.css">
<!--===============================================================================================-->
    <link rel="stylesheet" type="text/css" href="vendor/perfect-scrollbar/perfect-scrollbar.css">
<!--===============================================================================================-->
<link rel="stylesheet" type="text/css" href="css/util.css">
<link rel="stylesheet" type="text/css" href="css/main.css">
<link rel="stylesheet" href="css/styleee.css">
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.5.0/css/bootstrap.min.css">
  <script src="https://ajax.googleapis.com/ajax/libs/jquery/3.5.1/jquery.min.js"></script>
  <script src="https://cdnjs.cloudflare.com/ajax/libs/popper.js/1.16.0/umd/popper.min.js"></script>
  <script src="https://maxcdn.bootstrapcdn.com/bootstrap/4.5.0/js/bootstrap.min.js"></script>
{{-- <link rel="stylesheet" type="text/css" href="css/utill.css">
<link rel="stylesheet" type="text/css" href="css/mainn.css"> --}}
<!--===============================================================================================-->

</head>
<body>
    <header class="header-v3">
        <!-- Header desktop -->
        <div class="container-menu-desktop trans-03">
            <div class="wrap-menu-desktop">
                <nav class="limiter-menu-desktop p-l-45">
                    
                    <!-- Logo desktop -->		
                    <a href="/" class="logo">
                        <img src="../../images/icons/logo-02.png" alt="IMG-LOGO" style="width: 142px; height: 103px;">
                    </a>
                    <!-- Icon header -->
                    
                </nav>
            </div>	
        </div>

        <!-- Header Mobile -->
        <div class="wrap-header-mobile">
            <!-- Logo moblie -->		
            <div class="logo-mobile">
                <a href="/"><img src="../../images/icons/logo-01.png" alt="IMG-LOGO"></a>
            </div>
           
        </div>


        <!-- Menu Mobile -->
        <div class="menu-mobile">
            <ul class="main-menu-m">
                <li>
                    <a href="index.html">حسابي</a>
                    <ul class="sub-menu-m">
                        <li><a href="{{"login"}}">تسجيل الدخول</a></li>
                        <li><a href="{{"register"}}">تسجيل جديد</a></li>
                        
                    </ul>
                    <span class="arrow-main-menu-m">
                        <i class="fa fa-angle-right" aria-hidden="true"></i>
                    </span>
                </li>

                

                <li>
                    <a href="conect">اتصل بنا</a>
                </li>

                <li>
                    <a href="http://design.art-ink.net/">صمم معنا</a>
                </li>

                
            </ul>
        </div>

        
    </header>
    <br><br>
    <div class="wrapper" style="padding: 100px;">
        <div class="inner">

            <div class="card-body">
                <form method="POST" action="{{ route('register') }}">
                    @csrf
                    <h3>مستخدم جديد</h3>

                    <div class="form-wrapper">
                        <label for="name" >{{ __('الاسم') }}</label>

                        <div class="form-wrapper">
                            <input id="name" type="text" class="form-control @error('name') is-invalid @enderror" name="name" value="{{ old('name') }}" required autocomplete="name" autofocus>

                                @error('name')
                                <span class="invalid-feedback" role="alert">
                                    <strong>{{ $message }}</strong>
                                </span>
                                @enderror
                            </div>
                        </div>

                        <div class="form-wrapper">
                            <label for="email">{{ __(' البريد الالكتروني') }}</label>

                            <div class="form-wrapper">
                                <input id="email" type="email" class="form-control @error('email') is-invalid @enderror" name="email" value="{{ old('email') }}" required autocomplete="email">

                                @error('email')
                                    <span class="invalid-feedback" role="alert">
                                        <strong>{{ $message }}</strong>
                                    </span>
                                @enderror
                            </div>
                        </div>

                        <div class="form-wrapper">
                            <label for="password">{{ __('كلمة المرور') }}</label>

                            <div class="form-wrapper">
                                <input id="password" type="password" class="form-control @error('password') is-invalid @enderror" name="password" required autocomplete="new-password">

                                @error('password')
                                    <span class="invalid-feedback" role="alert">
                                        <strong>{{ $message }}</strong>
                                    </span>
                                @enderror
                            </div>
                        </div>

                        <div class="form-wrapper">
                            <label for="password-confirm">{{ __('تأكيد كلمة المرور ') }}</label>

                            <div class="form-wrapper">
                                <input id="password-confirm" type="password" class="form-control" name="password_confirmation" required autocomplete="new-password">
                            </div>
                        </div>
                        <div style="display: flex; align-items: center;">
                            
                            <input type="checkbox" required>

                            <a href="" data-toggle="modal" data-target="#myModal" style="margin-left: 15px;">أوافق على الشروط والأحكام</a>
                                                
                        </div>
                        
                        
                            
                       <br>

                        <a href="{{'login'}}">تسجيل الدخول </a>

                       <br><br>

                        <button type="submit">
                            {{ __('تسجيل') }}
                        </button>
                    </form>
          
            </div>
        </div>    
    </div>
    
    <div class="modal fade show" id="myModal" style="padding: 80px;">
       
        <div class="modal-dialog">
          <div class="modal-content">
          
            <!-- Modal Header -->
            <div class="modal-header">
              <h4 class="modal-title">الشروط والاحكام </h4>
              <button type="button" class="close" data-dismiss="modal">×</button>
            </div>
            
            <!-- Modal body -->
            <div class="modal-body">
            
                <div>
                    <h4> البيانات التي نجمعها</h4>
                    <p>قد نحتاج لجمع المعلومات الخاصة بكَ إذا أردت تسجيل طلبية شراءٍ لسلعةٍ من موقعنا.

                        نقوم بجمع البيانات لازمة أخرى لتأمين أية مطالب محتملة قد تظهر لاحقا­، ولتزويدكَ بالخدمات المتوفرة لدينا. مثال على ذلك ، الإسم والجنس وتاريخ الميلاد وعنوان البريد الإلكتروني والعنوان البريدي وعنوان التسليم (إذا كان مختلفًا) ورقم الهاتف ورقم الجوّال ورقم الفاكس وتفاصيل الدفع أي تفاصيلٍ عن بطاقات الدفع أو تفاصيلٍ عن الحساب المصرفي.
                        
                        تستخدم المعلومات التي تقدّمها لتزويدكَ بمعلومات حول المنتجات والخدمات المتوفرة لدينا والتي تطلبها ، وللتحقّقَ من المعاملات المالية التي تُجريها على الإنترنت وإدارة حسابك الخاص. كما تستخدم هذه المعلومات في عمليات تدقّيقَ تحميل البيانات من الموقع وتحديد هويّة زائري الموقع ، وتطوير تصاميم صفحات الموقع و / أو محتوياته وتخصيصها للمستخدمين. ونقومَ بأبحاثٍ عديدة متعلقة بالتركيبة السكانية، ونُرسلَ المعلوماتٍ المفيدة أو المطلوبة إلى المستخدم. ويتم التواصل عبر البريد الإلكتروني لتزويدكَ ببعض التفاصيل حول المنتجات والخدمات الأخرى إذا كنت ترغب في ذلك، وإذا كنتَ تفضّل عدم تلقي أية اتصالات ترويجية وتسويقيّةٍ ، يُرجى الانسحاب من هذا الخيار في أي وقتٍ من الأوقات.
                        
                        وقد نُقرُّ باسمك وعنوانك إلى طرفٍ ثالث بغية تسليمكَ طلبية شرائكَ (على سبيل المثال، عامل التسليم أو المورّد).
                        
                        قد يتم التواصل معك على رقم هاتفك لاعلامك بأي تحديث يتعلق بحالة طلبيتك أو لأي اعلان عن آخر تخفيضاتنا وعروضنا الترويجية.
                        
                        يقوم وكيلنا بإدارة المعاملات المالية عبر الإنترنت. وما عليك فعله هو تقديم معلومات دقيقة وغير مضلّلة للوكيل أو الموقع، ويجدر بك تحديثها على الدوام وإبلاغنا بالتغييرات.
                        
                        قد نتمكن من تخزين التفاصيل المتعلّقة بطلبيتك الحالية على موقعنا ولكن لا يمكننا سحبها مباشرةً لأسبابٍ أمنيّة. وبتسجيل الدخول إلى حسابك على الموقع يمكنك الاطلاع على المعلومات وتفاصيل مشترياتك التي طلبتها أو التي ستتقدّم بها قريبًا. وبمقدورك أيضًا إدارة تفاصيل عنوانك، والتفاصيل المصرفية وأية نشرةٍ إخباريةٍ قد اشتركت فيها. كما يجدر بك التعهّد بالتعامل بسريّة تامة عند النّفاذ إلى بياناتك الشخصيّة فلا تجعلها متاحةً لطرف ثالث غير مصرّح به. فنحن لا ن يمكنك النّفاذ إلى هذه المعلومات عن تحمّل أية مسؤولية ناتجة عن سوء استخدام كلمات السرّ إلا إذا كان سوء الاستخدام هذا نشأ عن خطأٍ منّا.
                        
                    </p>
                </div>  
                <div>
                    <h4>
                        البطاقات الائتمانية والحماية من الاحتيال الالكتروني

                    </h4>
                    <p>قد نستعين بجهات مختصة لحماية بياناتك من الاحتيال التجاري الالكتروني وذلك لمساعدتنا في اقرار بيانات طلبيات العملاء المجراه على الموقع . أدناه بالتفصيل دليل موجز حول كيفية استخدام هذه الجهات لبياناتك . الرجاء التواصل معنا اذا اردت معرفة المزيد من المعلومات حول هذا الموضوع او عن جهات الحماية من الغش التجاري المرتبطة بنا. يتم استخدام بياناتك بالطرق التالية :

                        سنبحث في جهات الحماية من الاحتيال التجاري (FPA) عن المعلومات للطلبات التي تم اجراؤها على الموقع.
                        
                        سنستخدم المعلومات المزودة لنا من جهات الحماية من الاحتيال (FPA) لمساعدتنا في اقرار بيانات طلبك الذي تم اجراؤه على الموقع.
                        
                        في حال ارسالك معلومات خاطئة أو غير دقيقة و ضبط حالة غش تجاري ، سيتم تحويل الحالة الى جهات الحماية من الاحتيال الالكتروني (FPA).</p>
                </div>
              <div>
                  <h4>استخدامات أخرى لمعلوماتك الشخصيّة</h4>
                  <p>قد نستخدم معلوماتك الشخصية في استطلاعات الرأي و أبحاث التسويق ، وفق رغبتك ،لأغراضٍ إحصائية مع ضمان سريتها التامة كما يحق لك الانسحاب في أيّ وقتٍ من الأوقات.ولا نقوم بإرسال أية أجوبة إلى طرفٍ ثالث. ولا يتم الإفصاح عن عنوان بريدك الالكتروني إلا إذا رغبتَ في المشاركة في المسابقات . ونقوم بالاحتفاظ بأجوبة استطلاعات الرأي في مكانٍ منفصل تماما عن بريدك الإلكتروني الخاص.

                    قد نقوم بإرسال معلومات عنا ، أو عن الموقع أو مواقعنا الأخرى أو عن منتجاتنا أو مبيعاتنا أو عروضات بيعنا أو نشراتنا وغير ذلك ممّا له علاقة بالشركات التابعة لمجموعتنا أو شُركائنا. وإذا كنت لا ترغب بالحصول على هذه المعلومات الإضافيّة (أو في أي جزءٍ منها)، يُرجى الضغط على رابط "إلغاء الاشتراك" الموجود في أي بريد إلكتروني مرسل إليك، وسنتوقّف عن إرسال هذه المعلومات لك في غضون سبع أيام عمل من استلام تبليغك. وسنتواصل معك للاستفسار عن المعلومات في حين عدم وضوحها.
                    
                    قد تستخدم بعض البيانات ،مع الحفاظ التام على الخصوصية والسرية على الموقع، لأغراضٍ أخرى بما في ذلك التحقق من أماكن تواجدهم ومتابعة زيارتهم للموقع أو الروابط الواردة في البريد الالكتروني في حين اشتراكهم لتلقيه، و لتزويد تلك البيانات المجهولة المصدر،والتي لا تسمح بتحديد هويّتك الشخصيّة الفعليّة، إلى طرف ثالث كالنّاشرين على سبيل المثال.</p>
              </div>
              <div>
                  <h4>
                    بيانات الدخول

                     
                  </h4>
                  <p>
                    في كل مرة تقوم فيها بزيارة  ، يتم إرسال المعلومات من المتصفح الى سجل ملفات الخادم دكان أفكار، حيث يتم حفظهاهناك. تضم المعلومات : الوقت والتاريخ لزيارة الموقع، الصفحات التي قمت بعرضها، عنوان IP ، العنوان الالكتروني URL الذي قادك الى  ، المعلومات المخزنة ونوع المتصفح المستخدم .

                    عندما نجمع كل هذه المعلومات ، يتم حذف كافة عناوين IP أو تحويلها الى عناوين مجهولة الهوية . يعني تجهيل هوية العناوين هو تغيير عنوان IP الخاص بك بحيث لا يمكن ربطه مع المستخدم الأصلي أو لا يمكن ربطه الا من خلال اجراء بحوث واسعة النطاق.
                    
                    يتم استخدام المعلومات المجهولة والمخزنة في ملف سجل الخادم لتحسين تجربة التسوق على موقع  وذلك لجعل تصفح الموقع لدينا أكثر سهولة، وإيجاد الأخطاء بسرعة وتوجيه قدرات الخادم للتطوير وفق أهمية الحاجة اليها . على سبيل المثال، هذه المعلومات تسمح لنا بحساب أوقات ذروة الازدحام لدينا وبالتالي في وضع خطة لتقدير قدرة الخادم الكافية للحفاظ على تشغيل موقعنا بأسرع ما يمكن.
                    
                    بموجب هذا ، فاني أمنح  السماحية بتحليل واستخدام بيانات البروتوكول لتطوير وتحسين أداء متجرهم للتسوق الالكتروني.
                  </p>
              </div>
              <div>
                  <h4>الأمان</h4>
                  <p>نستخدم تقنيات وإجراءات الأمان الملائمة لمنع نفاذٍ غير مصرّح به أو غير قانونيّ لمعلوماتك أو فقدانها أو تدميرها . فعندما نجمع البيانات من خلال الموقع، نقوم بتخزين معلوماتك الشخصية على قاعدة بيانات ضمن خادم إلكتروني آمن. فنستخدم أنظمة جُدر الحماية على خوادمنا. وعندما نقوم بجمع تفاصيل بطاقات الدفع إلكترونيًا، فإننا نحميها من خلال استخدام التشفير، مثل طبقة مآخذ التوصيل الآمنة (SSL ). فيصعب بالتّالي على أيّ متسلّلٍ فكّ تشفير معلوماتك بما أنّنّا لا نستطيع ضمان الحماية بنسبة مئة في المئة. وننصحك بشدّة عدم إرسال كامل تفاصيل بطاقة الائتمان أو بطاقة السحب الآلي عندما تتواصل معنا إلكترونيًا ومن دون تشفير. ونضع ضمانات ماديّة والكترونية وإجرائيّة مباشرة على عملية جمع معلوماتك اوالإفصاح عنها. وتتطلّب إجراءاتنا الأمنية أن نطلب منك أحيانًا إثبات هويتك قبل أن نفصح لك عن معلوماتك الشخصية. وتقع على عاتقك مسؤوليّة حماية كلمتك السريّة وحاسوبك من أيّ نفاذ غير مصرّح به.</p>
              </div>
              <div>
                  <h4>حقوقك</h4>
                  <p>في حال تشعر بالقلق على بياناتك، يحقّ لك طلب النّفاذ إلى البيانات الشخصيّة التي نحملها لك أو سبق ونقلتها إلينا. ويحقّ لك أن تطلب منّا تصحيح أية أخطاء في بياناتك الشخصيّة ويتم ذلك مجانًا. ولك الحقّ في مطالبتنا، في أي وقتٍ من الأوقات، بالكفّ عن استخدام بياناتك الشخصية لأغراض تسويقيّة مباشرة . نرجو من التواصل معنا عبر البريد الالكتروني</p>
              </div>
              <div>
                 <h4>التواصل الإلكتروني</h4>
                  <p>بموافقتك استخدام الموقع وخدماتنا الإلكترونية فإنك بذلك توافق على استقبال رسائلنا الإلكترونية بجميع أشكالها من خلال البريد الإلكتروني أو النشرات الدورية أو الإشعارات و التنبيهات المعلن عنها في الموقع الإلكتروني. بناءاً على ذلك فأنت توافق ضمنياً على أن جميع المعاملات الإلكترونية المرسلة لك من قبلنا هي ملزمة قانونيا وتعامل معاملة المعاملات الخطية. يحق لنا مراقبة وتسجيل وحفظ أي مكالمة هاتفية أو بريد الكتروني أو أي شكل آخر من اشكال التواصل الإلكتروني معك وذلك لأغراض تدريبية بهدف التحقق من النصائح والملاحظات الموجهة إلينا ولتحسين وتطوير نوعية الخدمة المقدمة لعملائنا.</p>
              </div>



            </div>
            
            <!-- Modal footer -->
            <div class="modal-footer">
              <button type="button" class="btn btn-danger" data-dismiss="modal">إغلاق</button>
            </div>
            
          </div>
        </div>
      
    </div>
    
    
</body>
</html>
